Table: Employee

| Column Name | Type    |
|-------------|---------|
| empId       | int     |
| name        | varchar |
| supervisor  | int     |
| salary      | int     |

empId is the column with unique values for this table.
Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.
 

Table: Bonus


| Column Name | Type |
|-------------|------|
| empId       | int  |
| bonus       | int  |

empId is the column of unique values for this table.
empId is a foreign key (reference column) to empId from the Employee table.
Each row of this table contains the id of an employee and their respective bonus.
 

Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:

| empId | name   | supervisor | salary |
|-------|--------|------------|--------|
| 3     | Brad   | null       | 4000   |
| 1     | John   | 3          | 1000   |
| 2     | Dan    | 3          | 2000   |
| 4     | Thomas | 3          | 4000   |

Bonus table:

| empId | bonus |
|-------|-------|
| 2     | 500   |
| 4     | 2000  |

Output: 

| name | bonus |
|------|-------|
| Brad | null  |
| John | null  |
| Dan  | 500   |

In [1]:
import pandas as pd
employee = pd.DataFrame({
    "empId": [3, 1, 2, 4],
    "name": ["Brad", "John", "Dan", "Thomas"],
    "supervisor":[3,3,3,3],
    "salary":[4000,1000,2000,4000]
})

bonus = pd.DataFrame({
    "empId": [2, 4],
    "bonus": [500, 2000]
})

In [ ]:
def employee_bonus(employee: pd.DataFrame, bonus: pd.DataFrame) -> pd.DataFrame:
    merged = employee.merge(bonus, how='left', on="empId") # empId üzerinden birleştirmek işlemi yapıldı
    return merged[(merged["bonus"].isna()) | (merged["bonus"]<1000)][["name","bonus"]] # 1000 altında olan veya null olan değerlerin name ve bonus olarak geri döndürücek df returnledik.

In [6]:
employee_bonus(employee,bonus)

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0